# Importing libraries
import pandas as pd
import numpy as np
import os

# Importing data files
df_ord_prd_dept = pd.read_pickle(r'C:\Users\Pakshil Jani\Desktop\career foundry\Chapter-4 Python\Instacart project analysis\Data\Prepared Data\orders_products_depts_merged.pkl')

In [6]:
df_ord_clean = pd.read_csv(r'C:\Users\Pakshil Jani\Desktop\career foundry\Chapter-4 Python\Instacart project analysis\Data\Prepared Data\orders_clean.csv',index_col=False)

In [4]:
df_ord_prd_dept.head(3)

,order_id,product_id,add_to_cart_order,reordered,product_name,aisle_id,product_id,prices,department
0,1107,1,7,0,Chocolate Sandwich Cookies,61,1,5.8,snacks
1,5319,1,3,1,Chocolate Sandwich Cookies,61,1,5.8,snacks
2,7540,1,4,1,Chocolate Sandwich Cookies,61,1,5.8,snacks

In [ ]:
# df_ord_prd_dept has duplicate column with name product_id. We will remove it before exporting the merged dataframe

In [8]:
df_ord_clean.head(3)

,Unnamed: 0,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0

In [9]:
df_ord_prd_dept.shape

(32399732, 9)

In [10]:
df_ord_clean.shape

(3421083, 7)

# Merging of two dataframes to create one final dataframe
df_merged = df_ord_prd_dept.merge(df_ord_clean,on='order_id',indicator=True)

In [12]:
df_merged.head(3)

,order_id,product_id,add_to_cart_order,reordered,product_name,aisle_id,product_id,prices,department,Unnamed: 0,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,_merge
0,1107,1,7,0,Chocolate Sandwich Cookies,61,1,5.8,snacks,634840,38259,2,1,11,7.0,both
1,1107,46149,6,0,Zero Calorie Cola,77,46149,13.4,beverages,634840,38259,2,1,11,7.0,both
2,1107,9434,2,0,Bag of Large Lemons,34,9434,8.3,frozen,634840,38259,2,1,11,7.0,both

In [14]:
df_merged._merge.value_counts()

both          32399732
left_only            0
right_only           0
Name: _merge, dtype: int64

In [15]:
df_merged.shape

(32399732, 16)

In [17]:
df_merged.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32399732 entries, 0 to 32399731
Data columns (total 16 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   product_id              int64
 2   add_to_cart_order       int64
 3   reordered               int64
 4   product_name            object
 5   aisle_id                int64
 6   product_id              int64
 7   prices                  float64
 8   department              object
 9   Unnamed: 0              int64
 10  user_id                 int64
 11  order_number            int64
 12  order_dow               int64
 13  order_hour_of_day       int64
 14  days_since_prior_order  float64
 15  _merge                  category
dtypes: category(1), float64(2), int64(11), object(2)
memory usage: 7.8 GB

In [ ]:
# To save memory, we will only keep required columns for analysis

In [22]:
required_columns = ['order_id','product_id','product_name','prices','department','user_id','order_number','order_dow','order_hour_of_day','days_since_prior_order']

In [23]:
df_ready = df_merged[required_columns]

In [24]:
df_ready.head(3)

,order_id,product_id,product_id,product_name,prices,department,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,1107,1,1,Chocolate Sandwich Cookies,5.8,snacks,38259,2,1,11,7.0
1,1107,46149,46149,Zero Calorie Cola,13.4,beverages,38259,2,1,11,7.0
2,1107,9434,9434,Bag of Large Lemons,8.3,frozen,38259,2,1,11,7.0

In [25]:
df_ready.shape

(32399732, 11)

In [ ]:
# Now, before exporting this dataframe, let us remove duplicate column name product_id

In [29]:
df_ready = df_ready.loc[:,~df_ready.columns.duplicated()]

In [30]:
df_ready.head(3)

,order_id,product_id,product_name,prices,department,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,1107,1,Chocolate Sandwich Cookies,5.8,snacks,38259,2,1,11,7.0
1,1107,46149,Zero Calorie Cola,13.4,beverages,38259,2,1,11,7.0
2,1107,9434,Bag of Large Lemons,8.3,frozen,38259,2,1,11,7.0

In [31]:
df_ready.to_pickle(r'C:\Users\Pakshil Jani\Desktop\career foundry\Chapter-4 Python\Instacart project analysis\Data\Prepared Data\df_ready.pkl')